In [1]:
import pandas as pd

In [2]:
dataset=pd.read_csv("Placement.csv")

In [3]:
from univariate import Univariate

In [4]:
obj=Univariate()

In [5]:
quan,qual=obj.QuanQual(dataset)

sl_no
gender
ssc_p
ssc_b
hsc_p
hsc_b
hsc_s
degree_p
degree_t
workex
etest_p
specialisation
mba_p
status
salary

In [6]:
quan

['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']

In [7]:
qual

['gender',
 'ssc_b',
 'hsc_b',
 'hsc_s',
 'degree_t',
 'workex',
 'specialisation',
 'status']

In [10]:
univarite=pd.DataFrame(index=["Mean"],columns=quan)

In [15]:
univarite

     sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Mean     0   NaN   NaN      NaN     NaN   NaN    NaN

In [14]:
univarite["sl_no"]["Mean"]

In [16]:
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()

In [19]:
univarite

     sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean   108  67.3034  66.3332  66.3702  72.1006  62.2782  288655

In [21]:
univarite=pd.DataFrame(index=["Mean","Median"],columns=quan)
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()
    univarite[columnName]["Median"]=dataset[columnName].median()

In [22]:
univarite

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean     108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   108       67       65       66       71       62  265000

In [29]:
univarite=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()
    univarite[columnName]["Median"]=dataset[columnName].median()
    univarite[columnName]["Mode"]=dataset[columnName].mode()

In [30]:
univarite

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108,67.3034,66.3332,66.3702,72.1006,62.2782,288655
Median,108,67,65,66,71,62,265000
Mode,0 1 1 2 2 3 3 4 4 ...,0 62.0 dtype: float64,0 63.0 dtype: float64,0 65.0 dtype: float64,0 60.0 dtype: float64,0 56.7 dtype: float64,0 300000.0 dtype: float64

In [40]:
dataset["ssc_p"].mode()[0]

62.0

In [31]:
univarite=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()
    univarite[columnName]["Median"]=dataset[columnName].median()
    univarite[columnName]["Mode"]=dataset[columnName].mode()[0]

In [32]:
univarite

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean     108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   108       67       65       66       71       62  265000
Mode       1       62       63       65       60     56.7  300000

In [33]:
dataset["ssc_p"].value_counts()

62.00    11
63.00    10
67.00     9
52.00     9
73.00     9
         ..
80.60     1
65.20     1
80.40     1
59.96     1
78.50     1
Name: ssc_p, Length: 103, dtype: int64

In [34]:
dataset["ssc_p"].cumsum()

0         67.00
1        146.33
2        211.33
3        267.33
4        353.13
         ...
210    14209.23
211    14267.23
212    14334.23
213    14408.23
214    14470.23
Name: ssc_p, Length: 215, dtype: float64